{"modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"config": {"output_layers": [["dense_1", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 299, 299, 3], "sparse": false, "dtype": "float32", "name": "input_1"}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "valid", "filters": 32, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [2, 2], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_1", "kernel_regularizer": null}, "name": "conv2d_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_1"}, "name": "batch_normalization_1"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_1"}, "name": "activation_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "valid", "filters": 32, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_2", "kernel_regularizer": null}, "name": "conv2d_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_2"}, "name": "batch_normalization_2"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_2"}, "name": "activation_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 64, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_3", "kernel_regularizer": null}, "name": "conv2d_3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_3"}, "name": "batch_normalization_3"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_3"}, "name": "activation_3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"pool_size": [3, 3], "trainable": false, "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}, "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "valid", "filters": 80, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_4", "kernel_regularizer": null}, "name": "conv2d_4"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_4"}, "name": "batch_normalization_4"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_4"}, "name": "activation_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "valid", "filters": 192, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_5", "kernel_regularizer": null}, "name": "conv2d_5"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_5"}, "name": "batch_normalization_5"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_5"}, "name": "activation_5"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"pool_size": [3, 3], "trainable": false, "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}, "name": "max_pooling2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 64, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_9", "kernel_regularizer": null}, "name": "conv2d_9"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_9"}, "name": "batch_normalization_9"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_9"}, "name": "activation_9"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 48, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_7", "kernel_regularizer": null}, "name": "conv2d_7"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 96, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_10", "kernel_regularizer": null}, "name": "conv2d_10"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_7"}, "name": "batch_normalization_7"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_10"}, "name": "batch_normalization_10"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_7"}, "name": "activation_7"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_10"}, "name": "activation_10"}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"pool_size": [3, 3], "trainable": false, "name": "average_pooling2d_1", "data_format": "channels_last", "strides": [1, 1], "padding": "same"}, "name": "average_pooling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 64, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_6", "kernel_regularizer": null}, "name": "conv2d_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 64, "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_8", "kernel_regularizer": null}, "name": "conv2d_8"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 96, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_11", "kernel_regularizer": null}, "name": "conv2d_11"}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 32, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_12", "kernel_regularizer": null}, "name": "conv2d_12"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_6"}, "name": "batch_normalization_6"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_8"}, "name": "batch_normalization_8"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_11"}, "name": "batch_normalization_11"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_12"}, "name": "batch_normalization_12"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_6"}, "name": "activation_6"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_8"}, "name": "activation_8"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_11"}, "name": "activation_11"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_12"}, "name": "activation_12"}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "config": {"axis": 3, "trainable": false, "name": "mixed0"}, "name": "mixed0"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 64, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_16", "kernel_regularizer": null}, "name": "conv2d_16"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_16"}, "name": "batch_normalization_16"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_16"}, "name": "activation_16"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 48, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_14", "kernel_regularizer": null}, "name": "conv2d_14"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 96, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_17", "kernel_regularizer": null}, "name": "conv2d_17"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_14"}, "name": "batch_normalization_14"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_17"}, "name": "batch_normalization_17"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_14"}, "name": "activation_14"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_17"}, "name": "activation_17"}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"pool_size": [3, 3], "trainable": false, "name": "average_pooling2d_2", "data_format": "channels_last", "strides": [1, 1], "padding": "same"}, "name": "average_pooling2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 64, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_13", "kernel_regularizer": null}, "name": "conv2d_13"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 64, "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_15", "kernel_regularizer": null}, "name": "conv2d_15"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 96, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_18", "kernel_regularizer": null}, "name": "conv2d_18"}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 64, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_19", "kernel_regularizer": null}, "name": "conv2d_19"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_13"}, "name": "batch_normalization_13"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_15"}, "name": "batch_normalization_15"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_18"}, "name": "batch_normalization_18"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_19"}, "name": "batch_normalization_19"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_13"}, "name": "activation_13"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_15"}, "name": "activation_15"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_18"}, "name": "activation_18"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_19"}, "name": "activation_19"}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]], "config": {"axis": 3, "trainable": false, "name": "mixed1"}, "name": "mixed1"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 64, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_23", "kernel_regularizer": null}, "name": "conv2d_23"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_23"}, "name": "batch_normalization_23"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_23"}, "name": "activation_23"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 48, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_21", "kernel_regularizer": null}, "name": "conv2d_21"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 96, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_24", "kernel_regularizer": null}, "name": "conv2d_24"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_21"}, "name": "batch_normalization_21"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_24"}, "name": "batch_normalization_24"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_21"}, "name": "activation_21"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_24"}, "name": "activation_24"}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"pool_size": [3, 3], "trainable": false, "name": "average_pooling2d_3", "data_format": "channels_last", "strides": [1, 1], "padding": "same"}, "name": "average_pooling2d_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 64, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_20", "kernel_regularizer": null}, "name": "conv2d_20"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 64, "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_22", "kernel_regularizer": null}, "name": "conv2d_22"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 96, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_25", "kernel_regularizer": null}, "name": "conv2d_25"}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 64, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_26", "kernel_regularizer": null}, "name": "conv2d_26"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_20"}, "name": "batch_normalization_20"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_22"}, "name": "batch_normalization_22"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_25"}, "name": "batch_normalization_25"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_26"}, "name": "batch_normalization_26"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_20"}, "name": "activation_20"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_22"}, "name": "activation_22"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_25"}, "name": "activation_25"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_26"}, "name": "activation_26"}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]], "config": {"axis": 3, "trainable": false, "name": "mixed2"}, "name": "mixed2"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 64, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_28", "kernel_regularizer": null}, "name": "conv2d_28"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_28"}, "name": "batch_normalization_28"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_28"}, "name": "activation_28"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 96, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_29", "kernel_regularizer": null}, "name": "conv2d_29"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_29"}, "name": "batch_normalization_29"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_29"}, "name": "activation_29"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "valid", "filters": 384, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [2, 2], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_27", "kernel_regularizer": null}, "name": "conv2d_27"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "valid", "filters": 96, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [2, 2], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_30", "kernel_regularizer": null}, "name": "conv2d_30"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_27"}, "name": "batch_normalization_27"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_30"}, "name": "batch_normalization_30"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_27"}, "name": "activation_27"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_30"}, "name": "activation_30"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"pool_size": [3, 3], "trainable": false, "name": "max_pooling2d_3", "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}, "name": "max_pooling2d_3"}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "config": {"axis": 3, "trainable": false, "name": "mixed3"}, "name": "mixed3"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 128, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_35", "kernel_regularizer": null}, "name": "conv2d_35"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_35"}, "name": "batch_normalization_35"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_35"}, "name": "activation_35"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_35", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "padding": "same", "filters": 128, "kernel_size": [7, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "trainable": false, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "conv2d_36", "kernel_regularizer": null}, "name": "conv2d_36"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "config": {"scale": false, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "name": "batch_normalization_36"}, "name": "batch_normalization_36"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "config": {"activation": "relu", "trainable": false, "name": "activation_36"}, "name": 