{"modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"output_layers": [["dense_1", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 299, 299, 3], "name": "input_1", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_1", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "data_format": "channels_last", "strides": [2, 2], "use_bias": false}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_1", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"name": "activation_1", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_2", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_2", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"name": "activation_2", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_3", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_3", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"name": "activation_3", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"pool_size": [3, 3], "name": "max_pooling2d_1", "padding": "valid", "trainable": false, "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_4", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_4", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"name": "activation_4", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_5", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_5", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"name": "activation_5", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"pool_size": [3, 3], "name": "max_pooling2d_2", "padding": "valid", "trainable": false, "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_9", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_9", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_9", "config": {"name": "activation_9", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_7", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_10", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_7", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_10", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_7", "config": {"name": "activation_7", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_10", "config": {"name": "activation_10", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_1", "config": {"pool_size": [3, 3], "name": "average_pooling2d_1", "padding": "same", "trainable": false, "data_format": "channels_last", "strides": [1, 1]}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_6", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_8", "kernel_constraint": null, "activation": "linear", "kernel_size": [5, 5], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_11", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_12", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_12", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_6", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_8", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_11", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_12", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"name": "activation_6", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_8", "config": {"name": "activation_8", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_11", "config": {"name": "activation_11", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_12", "config": {"name": "activation_12", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "mixed0", "config": {"trainable": false, "name": "mixed0", "axis": 3}, "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_16", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_16", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_16", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_16", "config": {"name": "activation_16", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_14", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_14", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_17", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_17", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_14", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_17", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_14", "config": {"name": "activation_14", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_17", "config": {"name": "activation_17", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_2", "config": {"pool_size": [3, 3], "name": "average_pooling2d_2", "padding": "same", "trainable": false, "data_format": "channels_last", "strides": [1, 1]}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_13", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_13", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_15", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_15", "kernel_constraint": null, "activation": "linear", "kernel_size": [5, 5], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_18", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_18", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_19", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_19", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_13", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_15", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_18", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_19", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_19", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_13", "config": {"name": "activation_13", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_15", "config": {"name": "activation_15", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_18", "config": {"name": "activation_18", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_19", "config": {"name": "activation_19", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "mixed1", "config": {"trainable": false, "name": "mixed1", "axis": 3}, "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_23", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_23", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_23", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_23", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_23", "config": {"name": "activation_23", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_21", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_21", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_24", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_24", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_21", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_21", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_24", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_24", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_21", "config": {"name": "activation_21", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_24", "config": {"name": "activation_24", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_3", "config": {"pool_size": [3, 3], "name": "average_pooling2d_3", "padding": "same", "trainable": false, "data_format": "channels_last", "strides": [1, 1]}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_20", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_20", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_22", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_22", "kernel_constraint": null, "activation": "linear", "kernel_size": [5, 5], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_25", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_25", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_26", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_26", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_20", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_20", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_22", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_22", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_25", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_25", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_26", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_26", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_20", "config": {"name": "activation_20", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_22", "config": {"name": "activation_22", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_25", "config": {"name": "activation_25", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_26", "config": {"name": "activation_26", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "mixed2", "config": {"trainable": false, "name": "mixed2", "axis": 3}, "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_28", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_28", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_28", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_28", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_28", "config": {"name": "activation_28", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_29", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_29", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_29", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_29", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_29", "config": {"name": "activation_29", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_27", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_27", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 384, "data_format": "channels_last", "strides": [2, 2], "use_bias": false}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_30", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_30", "kernel_constraint": null, "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "data_format": "channels_last", "strides": [2, 2], "use_bias": false}, "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_27", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_27", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_30", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_30", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_27", "config": {"name": "activation_27", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_30", "config": {"name": "activation_30", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"pool_size": [3, 3], "name": "max_pooling2d_3", "padding": "valid", "trainable": false, "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "mixed3", "config": {"trainable": false, "name": "mixed3", "axis": 3}, "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_35", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_35", "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_35", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_35", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_35", "config": {"name": "activation_35", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_36", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "name": "conv2d_36", "kernel_constraint": null, "activation": "linear", "kernel_size": [7, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "data_format": "channels_last", "strides": [1, 1], "use_bias": false}, "inbound_nodes": [[["activation_35", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_36", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "name": "batch_normalization_36", "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "scale": false, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_36", "config": {"name": "activation_36", 